#### Terraform Plan for /home/ubuntu/actions-runner/_work/argocd/argocd/infra/s3 <details><summary>Show Plan</summary> ```\n [command]/home/ubuntu/actions-runner/_work/_temp/d44dafae-b6c6-444a-b3e7-2a525dab0c66/terraform-bin plan -input=false -no-color Refreshing Terraform state in-memory prior to plan... The refreshed state will be used to calculate this plan, but will not be persisted to local or remote state storage. data.aws_ami.ubuntu: Refreshing state... ------------------------------------------------------------------------ An execution plan has been generated and is shown below. Resource actions are indicated with the following symbols: + create Terraform will perform the following actions: # aws_instance.web will be created + resource "aws_instance" "web" { + ami = "ami-01079af93e791f059" + arn = (known after apply) + associate_public_ip_address = (known after apply) + availability_zone = (known after apply) + cpu_core_count = (known after apply) + cpu_threads_per_core = (known after apply) + disable_api_termination = (known after apply) + ebs_optimized = (known after apply) + get_password_data = false + host_id = (known after apply) + id = (known after apply) + instance_initiated_shutdown_behavior = (known after apply) + instance_state = (known after apply) + instance_type = "t3.micro" + ipv6_address_count = (known after apply) + ipv6_addresses = (known after apply) + key_name = (known after apply) + monitoring = (known after apply) + outpost_arn = (known after apply) + password_data = (known after apply) + placement_group = (known after apply) + placement_partition_number = (known after apply) + primary_network_interface_id = (known after apply) + private_dns = (known after apply) + private_ip = (known after apply) + public_dns = (known after apply) + public_ip = (known after apply) + secondary_private_ips = (known after apply) + security_groups = (known after apply) + source_dest_check = true + subnet_id = (known after apply) + tags = { + "Name" = "HelloWorld" } + tags_all = { + "Name" = "HelloWorld" } + tenancy = (known after apply) + user_data = (known after apply) + user_data_base64 = (known after apply) + vpc_security_group_ids = (known after apply) + capacity_reservation_specification { + capacity_reservation_preference = (known after apply) + capacity_reservation_target { + capacity_reservation_id = (known after apply) } } + ebs_block_device { + delete_on_termination = (known after apply) + device_name = (known after apply) + encrypted = (known after apply) + iops = (known after apply) + kms_key_id = (known after apply) + snapshot_id = (known after apply) + tags = (known after apply) + throughput = (known after apply) + volume_id = (known after apply) + volume_size = (known after apply) + volume_type = (known after apply) } + enclave_options { + enabled = (known after apply) } + ephemeral_block_device { + device_name = (known after apply) + no_device = (known after apply) + virtual_name = (known after apply) } + metadata_options { + http_endpoint = (known after apply) + http_put_response_hop_limit = (known after apply) + http_tokens = (known after apply) + instance_metadata_tags = (known after apply) } + network_interface { + delete_on_termination = (known after apply) + device_index = (known after apply) + network_interface_id = (known after apply) } + root_block_device { + delete_on_termination = (known after apply) + device_name = (known after apply) + encrypted = (known after apply) + iops = (known after apply) + kms_key_id = (known after apply) + tags = (known after apply) + throughput = (known after apply) + volume_id = (known after apply) + volume_size = (known after apply) + volume_type = (known after apply) } } Plan: 1 to add, 0 to change, 0 to destroy. ------------------------------------------------------------------------ Note: You didn't specify an "-out" parameter to save this plan, so Terraform can't guarantee that exactly these actions will be performed if "terraform apply" is subsequently run. ::debug::Terraform exited with code 0. ::debug::stdout: Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_ami.ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
 + create

Terraform will perform the following actions:

 # aws_instance.web will be created
 + resource "aws_instance" "web" {
 + ami = "ami-01079af93e791f059"
 + arn = (known after apply)
 + associate_public_ip_address = (known after apply)
 + availability_zone = (known after apply)
 + cpu_core_count = (known after apply)
 + cpu_threads_per_core = (known after apply)
 + disable_api_termination = (known after apply)
 + ebs_optimized = (known after apply)
 + get_password_data = false
 + host_id = (known after apply)
 + id = (known after apply)
 + instance_initiated_shutdown_behavior = (known after apply)
 + instance_state = (known after apply)
 + instance_type = "t3.micro"
 + ipv6_address_count = (known after apply)
 + ipv6_addresses = (known after apply)
 + key_name = (known after apply)
 + monitoring = (known after apply)
 + outpost_arn = (known after apply)
 + password_data = (known after apply)
 + placement_group = (known after apply)
 + placement_partition_number = (known after apply)
 + primary_network_interface_id = (known after apply)
 + private_dns = (known after apply)
 + private_ip = (known after apply)
 + public_dns = (known after apply)
 + public_ip = (known after apply)
 + secondary_private_ips = (known after apply)
 + security_groups = (known after apply)
 + source_dest_check = true
 + subnet_id = (known after apply)
 + tags = {
 + "Name" = "HelloWorld"
 }
 + tags_all = {
 + "Name" = "HelloWorld"
 }
 + tenancy = (known after apply)
 + user_data = (known after apply)
 + user_data_base64 = (known after apply)
 + vpc_security_group_ids = (known after apply)

 + capacity_reservation_specification {
 + capacity_reservation_preference = (known after apply)

 + capacity_reservation_target {
 + capacity_reservation_id = (known after apply)
 }
 }

 + ebs_block_device {
 + delete_on_termination = (known after apply)
 + device_name = (known after apply)
 + encrypted = (known after apply)
 + iops = (known after apply)
 + kms_key_id = (known after apply)
 + snapshot_id = (known after apply)
 + tags = (known after apply)
 + throughput = (known after apply)
 + volume_id = (known after apply)
 + volume_size = (known after apply)
 + volume_type = (known after apply)
 }

 + enclave_options {
 + enabled = (known after apply)
 }

 + ephemeral_block_device {
 + device_name = (known after apply)
 + no_device = (known after apply)
 + virtual_name = (known after apply)
 }

 + metadata_options {
 + http_endpoint = (known after apply)
 + http_put_response_hop_limit = (known after apply)
 + http_tokens = (known after apply)
 + instance_metadata_tags = (known after apply)
 }

 + network_interface {
 + delete_on_termination = (known after apply)
 + device_index = (known after apply)
 + network_interface_id = (known after apply)
 }

 + root_block_device {
 + delete_on_termination = (known after apply)
 + device_name = (known after apply)
 + encrypted = (known after apply)
 + iops = (known after apply)
 + kms_key_id = (known after apply)
 + tags = (known after apply)
 + throughput = (known after apply)
 + volume_id = (known after apply)
 + volume_size = (known after apply)
 + volume_type = (known after apply)
 }
 }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ::debug::stderr: ::debug::exitcode: 0 ::set-output name=stdout::Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_ami.ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
 + create

Terraform will perform the following actions:

 # aws_instance.web will be created
 + resource "aws_instance" "web" {
 + ami = "ami-01079af93e791f059"
 + arn = (known after apply)
 + associate_public_ip_address = (known after apply)
 + availability_zone = (known after apply)
 + cpu_core_count = (known after apply)
 + cpu_threads_per_core = (known after apply)
 + disable_api_termination = (known after apply)
 + ebs_optimized = (known after apply)
 + get_password_data = false
 + host_id = (known after apply)
 + id = (known after apply)
 + instance_initiated_shutdown_behavior = (known after apply)
 + instance_state = (known after apply)
 + instance_type = "t3.micro"
 + ipv6_address_count = (known after apply)
 + ipv6_addresses = (known after apply)
 + key_name = (known after apply)
 + monitoring = (known after apply)
 + outpost_arn = (known after apply)
 + password_data = (known after apply)
 + placement_group = (known after apply)
 + placement_partition_number = (known after apply)
 + primary_network_interface_id = (known after apply)
 + private_dns = (known after apply)
 + private_ip = (known after apply)
 + public_dns = (known after apply)
 + public_ip = (known after apply)
 + secondary_private_ips = (known after apply)
 + security_groups = (known after apply)
 + source_dest_check = true
 + subnet_id = (known after apply)
 + tags = {
 + "Name" = "HelloWorld"
 }
 + tags_all = {
 + "Name" = "HelloWorld"
 }
 + tenancy = (known after apply)
 + user_data = (known after apply)
 + user_data_base64 = (known after apply)
 + vpc_security_group_ids = (known after apply)

 + capacity_reservation_specification {
 + capacity_reservation_preference = (known after apply)

 + capacity_reservation_target {
 + capacity_reservation_id = (known after apply)
 }
 }

 + ebs_block_device {
 + delete_on_termination = (known after apply)
 + device_name = (known after apply)
 + encrypted = (known after apply)
 + iops = (known after apply)
 + kms_key_id = (known after apply)
 + snapshot_id = (known after apply)
 + tags = (known after apply)
 + throughput = (known after apply)
 + volume_id = (known after apply)
 + volume_size = (known after apply)
 + volume_type = (known after apply)
 }

 + enclave_options {
 + enabled = (known after apply)
 }

 + ephemeral_block_device {
 + device_name = (known after apply)
 + no_device = (known after apply)
 + virtual_name = (known after apply)
 }

 + metadata_options {
 + http_endpoint = (known after apply)
 + http_put_response_hop_limit = (known after apply)
 + http_tokens = (known after apply)
 + instance_metadata_tags = (known after apply)
 }

 + network_interface {
 + delete_on_termination = (known after apply)
 + device_index = (known after apply)
 + network_interface_id = (known after apply)
 }

 + root_block_device {
 + delete_on_termination = (known after apply)
 + device_name = (known after apply)
 + encrypted = (known after apply)
 + iops = (known after apply)
 + kms_key_id = (known after apply)
 + tags = (known after apply)
 + throughput = (known after apply)
 + volume_id = (known after apply)
 + volume_size = (known after apply)
 + volume_type = (known after apply)
 }
 }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ::set-output name=stderr:: ::set-output name=exitcode::0 ``` </details> #### Terraform Plan for /home/ubuntu/actions-runner/_work/argocd/argocd/infra/s4 <details><summary>Show Plan</summary> ```\n [command]/home/ubuntu/actions-runner/_work/_temp/d44dafae-b6c6-444a-b3e7-2a525dab0c66/terraform-bin plan -input=false -no-color Refreshing Terraform state in-memory prior to plan... The refreshed state will be used to calculate this plan, but will not be persisted to local or remote state storage. ------------------------------------------------------------------------ An execution plan has been generated and is shown below. Resource actions are indicated with the following symbols: + create Terraform will perform the following actions: # aws_s3_bucket.b will be created + resource "aws_s3_bucket" "b" { + acceleration_status = (known after apply) + acl = "private" + arn = (known after apply) + bucket = "my-tf-test-bucket1" + bucket_domain_name = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags = { + "Environment" = "Dev" + "Name" = "My bucket" } + tags_all = { + "Environment" = "Dev" + "Name" = "My bucket" } + website_domain = (known after apply) + website_endpoint = (known after apply) + versioning { + enabled = (known after apply) + mfa_delete = (known after apply) } } Plan: 1 to add, 0 to change, 0 to destroy. ------------------------------------------------------------------------ Note: You didn't specify an "-out" parameter to save this plan, so Terraform can't guarantee that exactly these actions will be performed if "terraform apply" is subsequently run. ::debug::Terraform exited with code 0. ::debug::stdout: Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
 + create

Terraform will perform the following actions:

 # aws_s3_bucket.b will be created
 + resource "aws_s3_bucket" "b" {
 + acceleration_status = (known after apply)
 + acl = "private"
 + arn = (known after apply)
 + bucket = "my-tf-test-bucket1"
 + bucket_domain_name = (known after apply)
 + bucket_regional_domain_name = (known after apply)
 + force_destroy = false
 + hosted_zone_id = (known after apply)
 + id = (known after apply)
 + region = (known after apply)
 + request_payer = (known after apply)
 + tags = {
 + "Environment" = "Dev"
 + "Name" = "My bucket"
 }
 + tags_all = {
 + "Environment" = "Dev"
 + "Name" = "My bucket"
 }
 + website_domain = (known after apply)
 + website_endpoint = (known after apply)

 + versioning {
 + enabled = (known after apply)
 + mfa_delete = (known after apply)
 }
 }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ::debug::stderr: ::debug::exitcode: 0 ::set-output name=stdout::Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
 + create

Terraform will perform the following actions:

 # aws_s3_bucket.b will be created
 + resource "aws_s3_bucket" "b" {
 + acceleration_status = (known after apply)
 + acl = "private"
 + arn = (known after apply)
 + bucket = "my-tf-test-bucket1"
 + bucket_domain_name = (known after apply)
 + bucket_regional_domain_name = (known after apply)
 + force_destroy = false
 + hosted_zone_id = (known after apply)
 + id = (known after apply)
 + region = (known after apply)
 + request_payer = (known after apply)
 + tags = {
 + "Environment" = "Dev"
 + "Name" = "My bucket"
 }
 + tags_all = {
 + "Environment" = "Dev"
 + "Name" = "My bucket"
 }
 + website_domain = (known after apply)
 + website_endpoint = (known after apply)

 + versioning {
 + enabled = (known after apply)
 + mfa_delete = (known after apply)
 }
 }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ::set-output name=stderr:: ::set-output name=exitcode::0 ``` </details>